tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf2685_tdd.h
#define LC2                           3881
#define LATC3                         3882
#define LC3                           3883
#define LATC4                         3884
#define LC4                           3885
#define LATC5                         3886
#define LC5                           3887
#define LATC6                         3888
#define LC6                           3889
#define LATC7                         3890
#define LC7                           3891
#define TRISA                         3892
#define TRISA0                        3893
#define TRISA_RA0                     3894
#define TRISA1                        3895
#define TRISA_RA1                     3896
#define TRISA2                        3897
#define TRISA_RA2                     3898
#define TRISA3                        3899
#define TRISA_RA3                     3900
#define TRISA_RA4                     3901
#define TRISA4                        3902
#define TRISA_RA5                     3903
#define TRISA5                        3904
#define TRISA_RA6                     3905
#define TRISA6                        3906
#define TRISA_RA7                     3907
#define TRISA7                        3908
#define TRISB                         3909
#define TRISB_RB0                     3910
#define TRISB0                        3911
#define TRISB_RB1                     3912
#define TRISB1                        3913
#define TRISB_RB2                     3914
#define TRISB2                        3915
#define TRISB_RB3                     3916
#define TRISB3                        3917
#define TRISB_RB4                     3918
#define TRISB4                        3919
#define TRISB_RB5                     3920
#define TRISB5                        3921
#define TRISB_RB6                     3922
#define TRISB6                        3923
#define TRISB_RB7                     3924
#define TRISB7                        3925
#define TRISC                         3926
#define TRISC0                        3927
#define TRISC_RC0                     3928
#define TRISC1                        3929
#define TRISC_RC1                     3930
#define TRISC2                        3931
#define TRISC_RC2                     3932
#define TRISC3                        3933
#define TRISC_RC3                     3934
#define TRISC4                        3935
#define TRISC_RC4                     3936
#define TRISC5                        3937
#define TRISC_RC5                     3938
#define TRISC6                        3939
#define TRISC_RC6                     3940
#define TRISC7                        3941
#define TRISC_RC7                     3942
#define OSCTUNE                       3943
#define TUN0                          3944
#define TUN                           3945
#define TUN1                          3946
#define TUN2                          3947
#define TUN3                          3948
#define TUN4                          3949
#define PLLEN                         3950
#define INTSCR                        3951
#define INTSRC                        3952
#define PIE1                          3953
#define TMR1IE                        3954
#define TMR2IE                        3955
#define CCP1IE                        3956
#define SSPIE                         3957
#define PIE1_TX1IE                    3958
#define TXIE                          3959
#define RCIE                          3960
#define RC1IE                         3961
#define ADIE                          3962
#define PIR1                          3963
#define TMR1IF                        3964
#define TMR2IF                        3965
#define CCP1IF                        3966
#define SSPIF                         3967
#define TXIF                          3968
#define PIR1_TX1IF                    3969
#define RCIF                          3970
#define RC1IF                         3971
#define ADIF                          3972
#define IPR1                          3973
#define TMR1IP                        3974
#define TMR2IP                        3975
#define CCP1IP                        3976
#define SSPIP                         3977
#define TXBIP                         3978
#define TX1IP                         3979
#define TXIP                          3980
#define RCIP                          3981
#define RC1IP                         3982
#define ADIP                          3983
#define PIE2                          3984
#define TMR3IE                        3985
#define HLVDIE                        3986
#define LVDIE                         3987
#define BCLIE                         3988
#define EEIE                          3989
#define OSCFIE                        3990
#define PIR2                          3991
#define TMR3IF                        3992
#define HLVDIF                        3993
#define LVDIF                         3994
#define BCLIF                         3995
#define EEIF                          3996
#define OSCFIF                        3997
#define IPR2                          3998
#define TMR3IP                        3999
#define HLVDIP                        4000
#define LVDIP                         4001
#define BCLIP                         4002
#define EEIP                          4003
#define OSCFIP                        4004
#define PIE3                          4005
#define FIFOMWIE                      4006
#define FIFOWMIE                      4007
#define PIE3_RXB0IE                   4008
#define RXBnIE                        4009
#define RXBNIE                        4010
#define PIE3_RXB1IE                   4011
#define PIE3_TXB0IE                   4012
#define PIE3_TXB1IE                   4013
#define TXBnIE                        4014
#define PIE3_TXB2IE                   4015
#define TXBNIE                        4016
#define ERRIE                         4017
#define WAKIE                         4018
#define IRXIE                         4019
#define PIR3                          4020
#define FIFOWMIF                      4021
#define RXB0IF                        4022
#define RXBnIF                        4023
#define RXBNIF                        4024
#define RXB1IF                        4025
#define TXB0IF                        4026
#define TXB1IF                        4027
#define TXB2IF                        4028
#define TXBNIF                        4029
#define TXBnIF                        4030
#define ERRIF                         4031
#define WAKIF                         4032
#define IRXIF                         4033
#define IPR3                          4034
#define RXB0IP                        4035
#define FIFOWMIP                      4036
#define RXB1IP                        4037
#define RXBNIP                        4038
#define RXBnIP                        4039
#define TXB0IP                        4040
#define TXB1IP                        4041
#define TXBNIP                        4042
#define TXBnIP                        4043
#define TXB2IP                        4044
#define ERRIP                         4045
#define WAKIP                         4046
#define IRXIP                         4047
#define EECON1                        4048
#define RD                            4049
#define WR                            4050
#define WREN                          4051
#define WRERR                         4052
#define FREE                          4053
#define CFGS                          4054
#define EEFS                          4055
#define EEPGD                         4056
#define RCSTA                         4057
#define RCD8                          4058
#define RX9D                          4059
#define OERR                          4060
#define FERR                          4061
#define ADDEN                         4062
#define ADEN                          4063
#define CREN                          4064
#define SRENA                         4065
#define SREN                          4066
#define RC9                           4067
#define RC8_9                         4068
#define RX9                           4069
#define SPEN                          4070
#define TXSTA                         4071
#define TXD8                          4072
#define TX9D1                         4073
#define TX9D                          4074
#define TRMT                          4075
#define TRMT1                         4076
#define BRGH1                         4077
#define BRGH                          4078
#define SENDB1                        4079
#define SENDB                         4080
#define SYNC                          4081
#define SYNC1                         4082
#define TXEN1                         4083
#define TXEN                          4084
#define TX91                          4085
#define TX8_9                         4086
#define TX9                           4087
#define CSRC1                         4088
#define CSRC                          4089
#define T3CON                         4090
#define TMR3ON                        4091
#define TMR3CS                        4092
#define nT3SYNC                       4093
#define T3NSYNC                       4094
#define NOT_T3SYNC                    4095
#define T3SYNC                        4096
#define SOSCEN3                       4097
#define T3CCP1                        4098
#define T3CKPS                        4099
#define T3CKPS0                       4100
#define T3CKPS1                       4101
#define T3ECCP1                       4102
#define T3CCP2                        4103
#define T3CON_RD16                    4104
#define RD163                         4105
#define T3RD16                        4106
#define ECCP1AS                       4107
#define PSSAC                         4108
#define PSSAC0                        4109
#define PSSAC1                        4110
#define ECCPAS0                       4111
#define ECCPAS                        4112
#define ECCPAS1                       4113
#define ECCPAS2                       4114
#define ECCPASE                       4115
#define ECCP1DEL                      4116
#define PRSEN                         4117
#define BAUDCON                       4118
#define ABDEN                         4119
#define W4E                           4120
#define WUE                           4121
#define BRG16                         4122
#define TXCKP                         4123
#define SCKP                          4124
#define RXCKP                         4125
#define RXDTP                         4126
#define RCIDL                         4127
#define ABDOVF                        4128
#define CCP1CON                       4129
#define CCP1M0                        4130
#define CCP1M                         4131
#define CCP1M1                        4132
#define CCP1M2                        4133
#define CCP1M3                        4134
#define DC1B                          4135
#define DC1B0                         4136
#define DC1B1                         4137
#define ADCON2                        4138
#define ADCS0                         4139
#define ADCS                          4140
#define ADCS1                         4141
#define ADCS2                         4142
#define ACQT0                         4143
#define ACQT                          4144
#define ACQT1                         4145
#define ACQT2                         4146
#define ADFM                          4147
#define ADCON1                        4148
#define PCFG0                         4149
#define PCFG                          4150
#define PCFG1                         4151
#define PCFG2                         4152
#define CHSN3                         4153
#define PCFG3                         4154
#define VCFG                          4155
#define VCFG0                         4156
#define VCFG01                        4157
#define VCFG11                        4158
#define VCFG1                         4159
#define ADCON0                        4160
#define ADON                          4161
#define nDONE                         4162
#define GO_nDONE                      4163
#define NOT_DONE                      4164
#define GODONE                        4165
#define GO_DONE                       4166
#define DONE                          4167
#define GO_NOT_DONE                   4168
#define GO                            4169
#define CHS0                          4170
#define CHS                           4171
#define CHS1                          4172
#define CHS2                          4173
#define CHS3                          4174
#define SSPCON2                       4175
#define SEN                           4176
#define RSEN                          4177
#define PEN                           4178
#define RCEN                          4179
#define ACKEN                         4180
#define ACKDT                         4181
#define ACKSTAT                       4182
#define GCEN                          4183
#define SSPCON1                       4184
#define SSPM0                         4185
#define SSPM                          4186
#define SSPM1                         4187
#define SSPM2                         4188
#define SSPM3                         4189
#define CKP                           4190
#define SSPEN                         4191
#define SSPOV                         4192
#define WCOL                          4193
#define SSPSTAT                       4194
#define BF                            4195
#define UA                            4196
#define R_NOT_W                       4197
#define READ_WRITE                    4198
#define NOT_W                         4199
#define R_W                           4200
#define nW                            4201
#define RW                            4202
#define nWRITE                        4203
#define R                             4204
#define NOT_WRITE                     4205
#define R_nW                          4206
#define I2C_READ                      4207
#define START                         4208
#define S                             4209
#define I2C_START                     4210
#define STOP                          4211
#define I2C_STOP                      4212
#define P                             4213
#define NOT_A                         4214
#define DATA_ADDRESS                  4215
#define nA                            4216
#define D_A                           4217
#define D_nA                          4218
#define D                             4219
#define DA                            4220
#define D_NOT_A                       4221
#define NOT_ADDRESS                   4222
#define nADDRESS                      4223
#define I2C_DAT                       4224
#define CKE                           4225
#define SMP                           4226
#define T2CON                         4227
#define T2CKPS0                       4228
#define T2CKPS                        4229
#define T2CKPS1                       4230
#define TMR2ON                        4231
#define T2OUTPS0                      4232
#define TOUTPS                        4233
#define T2OUTPS1                      4234
#define T2OUTPS2                      4235
#define T2OUTPS3                      4236
#define PR2                           4237
#define WM0                           4238
#define WM1                           4239
#define WAIT0                         4240
#define WAIT1                         4241
#define EBDIS                         4242
#define T1CON                         4243
#define TMR1ON                        4244
#define TMR1CS                        4245
#define NOT_T1SYNC                    4246
#define T1SYNC                        4247
#define nT1SYNC                       4248
#define T1INSYNC                      4249
#define T1OSCEN                       4250
#define SOSCEN                        4251
#define T1CKPS0                       4252
#define T1CKPS                        4253
#define T1CKPS1                       4254
#define T1RUN                         4255
#define T1RD16                        4256
#define T1CON_RD16                    4257
#define RCON                          4258
#define BOR                           4259
#define NOT_BOR                       4260
#define nBOR                          4261
#define POR                           4262
#define nPOR                          4263
#define NOT_POR                       4264
#define PD                            4265
#define nPD                           4266
#define NOT_PD                        4267
#define NOT_TO                        4268
#define nTO                           4269
#define TO                            4270
#define nRI                           4271
#define NOT_RI                        4272
#define RI                            4273
#define SBOREN                        4274
#define IPEN                          4275
#define WDTCON                        4276
#define SWDTE                         4277
#define SWDTEN                        4278
#define HLVDCON                       4279
#define HLVDL                         4280
#define HLVDL0                        4281
#define LVV0                          4282
#define LVDL0                         4283
#define HLVDL1                        4284
#define LVDL1                         4285
#define LVV1                          4286
#define HLVDL2                        4287
#define LVV2                          4288
#define LVDL2                         4289
#define HLVDL3                        4290
#define LVV3                          4291
#define LVDL3                         4292
#define HLVDEN                        4293
#define LVDEN                         4294
#define BGST                          4295
#define IRVST                         4296
#define IVRST                         4297
#define VDIRMAG                       4298
#define OSCCON                        4299
#define SCS0                          4300
#define SCS                           4301
#define SCS1                          4302
#define IOFS                          4303
#define OSTS                          4304
#define IRCF                          4305
#define IRCF0                         4306
#define IRCF1                         4307
#define IRCF2                         4308
#define IDLEN                         4309
#define T0CON                         4310
#define T0PS                          4311
#define T0PS0                         4312
#define T0PS1                         4313
#define T0PS2                         4314
#define PSA                           4315
#define T0PS3                         4316
#define T0SE                          4317
#define T0CS                          4318
#define T08BIT                        4319
#define TMR0ON                        4320
#define STATUS                        4321
#define C                             4322
#define CARRY                         4323
#define DC                            4324
#define ZERO                          4325
#define Z                             4326
#define OV                            4327
#define OVERFLOW                      4328
#define N                             4329
#define NEGATIVE                      4330
#define INTCON3                       4331
#define INT1IF                        4332
#define INT1F                         4333
#define INT2IF                        4334
#define INT2F                         4335
#define INT1E                         4336
#define INT1IE                        4337
#define INT2IE                        4338
#define INT2E                         4339
#define INT1P                         4340
#define INT1IP                        4341
#define INT2IP                        4342
#define INT2P                         4343
#define INTCON2                       4344
#define RBIP                          4345
#define TMR0IP                        4346
#define T0IP                          4347
#define INTEDG2                       4348
#define INTEDG1                       4349
#define INTEDG0                       4350
#define RBPU                          4351
#define NOT_RBPU                      4352
#define nRBPU                         4353
#define INTCON                        4354
#define RBIF                          4355
#define INT0F                         4356
#define INT0IF                        4357
#define T0IF                          4358
#define TMR0IF                        4359
#define RBIE                          4360
#define INT0E                         4361
#define INT0IE                        4362
#define T0IE                          4363
#define TMR0IE                        4364
#define PEIE                          4365
#define PEIE_GIEL                     4366
#define GIEL                          4367
#define GIE_GIEH                      4368
#define GIE                           4369
#define GIEH                          4370
#define STKPTR0                       4371
#define STKPTR                        4372
#define SP0                           4373
#define STKPTR1                       4374
#define SP1                           4375
#define STKPTR2                       4376
#define SP2                           4377
#define SP3                           4378
#define STKPTR3                       4379
#define STKPTR4                       4380
#define SP4                           4381
#define STKUNF                        4382
#define STKOVF                        4383
#define STKFUL                        4384

#endif // _PIC18LF2685_H_
